example_app/app/controllers/categories_controller.rb

SELECT * FROM "categories"
---
  def index
    @categories = Category.all

SELECT * FROM "categories" WHERE ("categories"."id" = 1)
---
  def show
    @category = Category.find(params[:id])

INSERT INTO "categories" ("name", "created_at", "updated_at", "lft", "parent_id", "description", "rgt") VALUES('First Category', '2010-09-03 22:47:36', '2010-09-03 22:47:36', 1, NULL, 'This is the first category description, the edit field can be modified. This field is completely optional, but useful if you want to add a summary for your categories.', 2)
---
  def create
    @category = Category.new(params[:category])
    if @category.save

SELECT * FROM "categories" WHERE ("categories"."id" = 1)
DELETE FROM "categories" WHERE "id" = 1
---
  def destroy
    @category = Category.find(params[:id])
    @category.destroy

SELECT * FROM "categories" WHERE ("categories"."id" IN ('','1')) LIMIT 1
---
  def array
     # assign the sorted tree to a variable
     newlist = params[:ul]
     # initialize the previous item
     previous = nil
     #loop through each item in the new list (passed via ajax)
     newlist.each_with_index do |array, index|
       # get the category id of the item being moved
       moved_item_id = array[1][:id].split(/category_/)
       # find the object that is being moved (in database)
       @current_category = Category.find_by_id(moved_item_id)